Tekla.Structures.Model.Reinforcement.RebarOffsetTypeEnum
The different types of offsets.

Tekla.Structures.Model.Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS
The concrete cover thickness.

Tekla.Structures.Model.Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_LEG_LENGTH
The leg length.